Read in the file `./data/sales.csv`

In [1]:
import pandas as pd
sales = pd.read_csv('./data/sales.csv', parse_dates=['date'])
sales.head()

   order_num  line_num       date       sku  qty
0          0         0 2011-01-01   sku4333    6
1          0         1 2011-01-01  sku76536    7
2          1         0 2011-01-02  sku75108    3
3          1         1 2011-01-02  sku78838    9
4          1         2 2011-01-02  sku77480    9

Read in the file `./data/prices.csv`

In [2]:
prices = pd.read_csv('./data/prices.csv', index_col='Unnamed: 0')
prices.head()

       sku category    price
0  sku0000  Toilets  2085.11
1  sku0001     Misc  3601.62
2  sku0002     Misc     0.57
3  sku0003  Faucets  1511.66
4  sku0004  Toilets   733.78

Merge the sales and prices data on the sku

In [3]:
merged_sales = pd.merge(sales, prices) # , on='sku')
merged_sales.head()

   order_num  line_num       date       sku  qty category    price
0          0         0 2011-01-01   sku4333    6  Showers  1563.90
1        641         3 2012-10-10   sku4333    8  Showers  1563.90
2          0         1 2011-01-01  sku76536    7  Faucets  3121.99
3          1         0 2011-01-02  sku75108    3     Misc   819.55
4          1         1 2011-01-02  sku78838    9  Showers  2531.54

Generate a revenue column based on price * qty

In [4]:
merged_sales['revenue'] = merged_sales.qty * merged_sales.price
merged_sales.head()

   order_num  line_num       date       sku  qty category    price   revenue
0          0         0 2011-01-01   sku4333    6  Showers  1563.90   9383.40
1        641         3 2012-10-10   sku4333    8  Showers  1563.90  12511.20
2          0         1 2011-01-01  sku76536    7  Faucets  3121.99  21853.93
3          1         0 2011-01-02  sku75108    3     Misc   819.55   2458.65
4          1         1 2011-01-02  sku78838    9  Showers  2531.54  22783.86

Save the merged sales data as `./data/merged-sales.csv`

In [5]:
merged_sales.to_csv('./data/merged-sales.csv', index=False)

In [6]:
!head ./data/merged-sales.csv

order_num,line_num,date,sku,qty,category,price,revenue
0,0,2011-01-01,sku4333,6,Showers,1563.9,9383.400000000001
641,3,2012-10-10,sku4333,8,Showers,1563.9,12511.2
0,1,2011-01-01,sku76536,7,Faucets,3121.99,21853.93
1,0,2011-01-02,sku75108,3,Misc,819.55,2458.6499999999996
1,1,2011-01-02,sku78838,9,Showers,2531.54,22783.86
1,2,2011-01-02,sku77480,9,Faucets,848.53,7636.7699999999995
2,0,2011-01-05,sku45155,3,Misc,2682.97,8048.91
2,1,2011-01-05,sku67327,9,Misc,1593.51,14341.59
2,2,2011-01-05,sku27757,8,Misc,1236.75,9894.0